Repository: ibad-al-rahman/ios-public
Catalog: PublicSector/Resources/Events.xcstrings
Source language: en
Languages: ar

# ashura
source: Ashura commemoration
ar: ذكرى عاشوراء

# battle_of_badr
source: The anniversary of the Battle of Badr (2 AH)
ar: ذكرى غزوة بدر الكبرى (٢ هـ)

# battle_of_hattin
source: The anniversary of the Battle of Hattin (583 AH)
ar: ذكرى معركة حطّين (٥٨٣هـ)

# battle_of_mutah
source: The anniversary of the Battle of Mu'tah (8 AH)
ar: ذكرى غزوة مؤتة (٨ هـ)

# battle_of_tabuk
source: The anniversary of the Battle of Tabuk (9 AH)
ar: ذكرى غزوة تبوك (٩ هـ)

# battle_of_uhud
source: The anniversary of the Battle of Uhud (3 AH)
ar: ذكرى غزوة أُحُد (٣ هـ)

# conquest_of_mecca
source: Anniversary of the Conquest of Mecca (8 AH)
ar: ذكرى فتح مكة (٨ هـ)

# day_of_arafah
source: Standing at Arafat
ar: الوقوف في عرفة

# eid_al_adha
source: The first day of Eid al-Adha
ar: أوّل أيّام عيد الأضحى المبارك

# eid_al_fitr
source: The first day of Eid al-Fitr
ar: أوّل أيّام عيد الفطر المبارك

source: First of Ramadan
ar: أوّل أيّام شهر رمضان المبارك

# islamic_new_year
source: The beginning of the Hijri year
ar: بداية العام الهجري

source: Isra and Mi'raj
ar: ذكرى الإسراء والمعراج

# laylat_al_qadr
source: Laylat-ul-Qadr
ar: ليلة القدر

# mawlid_al_nabi
source: The anniversary of the birth of the Prophet (peace be upon him)
ar: ذكرى مولد الرسول ﷺ

# nisf_shaban
source: The night of the middle of Sha'ban
ar: ليلة النّصف من شعبان
